public_html/C-C++/C++/C++11-atomic- operations.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>C++11 atomic operations</title>
<!-- 2014-08-26 Tue 20:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">C++11 atomic operations</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Overview</a></li>
<li><a href="#sec-2">Lock-free property</a></li>
<li><a href="#sec-3">Atomic types</a></li>
<li><a href="#sec-4">Flag type and operations</a></li>
<li><a href="#sec-5">Memory synchronization ordering</a></li>
<li><a href="#sec-6">其他资料</a>
<ul>
<li><a href="#sec-6-1">Online resources</a></li>
</ul>
</li>
<li><a href="#sec-7">Header synopsis</a>
<ul>
<li><a href="#sec-7-1"><code>&lt;atomic&gt;</code></a></li>
</ul>
</li>
<li><a href="#sec-8">cc</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Overview</h2>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Lock-free property</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_BOOL_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_CHAR_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_CHAR16_T_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_CHAR32_T_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_WCHAR_T_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_SHORT_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_INT_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_LONG_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_LLONG_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_POINTER_LOCK_FREE</span> unspecified
</pre>
</div>

<p>
The ATOMIC_&#x2026;<sub>LOCK</sub><sub>FREE</sub> macros indicate the lock-free property of the
corresponding atomic types, with the signed and unsigned variants
grouped together. The properties also apply to the corresponding
(partial) specializations of the atomic template. A value of 0
indicates that the types are never lock-free. A value of 1 indicates
that the types are sometimes lock-free. A value of 2 indicates that
the types are always lock-free.
</p>

<p>
The function atomic<sub>is</sub><sub>lock</sub><sub>free</sub> (29.6) indicates whether the object
is lock-free. In any given program execution, the result of the
lock-free query shall be consistent for all pointers of the same type.
</p>
</div>
</div>
