src/C-C++/C++/C++11-atomic- operations.org
* Atomic types
#+begin_src c++
  namespace std {
  template <class T> struct atomic {
    bool is_lock_free() const volatile noexcept;
    bool is_lock_free() const noexcept;
    void store(T, memory_order = memory_order_seq_cst) volatile noexcept;
    void store(T, memory_order = memory_order_seq_cst) noexcept;
    T load(memory_order = memory_order_seq_cst) const volatile noexcept;
    T load(memory_order = memory_order_seq_cst) const noexcept;
    operator T() const volatile noexcept;
    operator T() const noexcept;
    T exchange(T, memory_order = memory_order_seq_cst) volatile noexcept;
    T exchange(T, memory_order = memory_order_seq_cst) noexcept;
    bool compare_exchange_weak(T&, T, memory_order, memory_order) volatile noexcept;
    bool compare_exchange_weak(T&, T, memory_order, memory_order) noexcept;
    bool compare_exchange_strong(T&, T, memory_order, memory_order) volatile noexcept;
    bool compare_exchange_strong(T&, T, memory_order, memory_order) noexcept;
    bool compare_exchange_weak(T&, T, memory_order = memory_order_seq_cst) volatile noexcept;
    bool compare_exchange_weak(T&, T, memory_order = memory_order_seq_cst) noexcept;
    bool compare_exchange_strong(T&, T, memory_order = memory_order_seq_cst) volatile noexcept;
    bool compare_exchange_strong(T&, T, memory_order = memory_order_seq_cst) noexcept;
    atomic() noexcept = default;
    constexpr atomic(T) noexcept;
    atomic(const atomic&) = delete;
    atomic& operator=(const atomic&) = delete;
    atomic& operator=(const atomic&) volatile = delete;
    T operator=(T) volatile noexcept;
    T operator=(T) noexcept;
  };
            
  template <> struct atomic<integral > {
    bool is_lock_free() const volatile noexcept;
    bool is_lock_free() const noexcept;
    void store(integral , memory_order = memory_order_seq_cst) volatile noexcept;
    void store(integral , memory_order = memory_order_seq_cst) noexcept;
    integral load(memory_order = memory_order_seq_cst) const volatile noexcept;
    integral load(memory_order = memory_order_seq_cst) const noexcept;
    operator integral() const volatile noexcept;
    operator integral() const noexcept;
    integral exchange(integral , memory_order = memory_order_seq_cst) volatile noexcept;
    integral exchange(integral , memory_order = memory_order_seq_cst) noexcept;
    bool compare_exchange_weak(integral &, integral , memory_order, memory_order) volatile noexcept;
    bool compare_exchange_weak(integral &, integral , memory_order, memory_order) noexcept;
    bool compare_exchange_strong(integral &, integral , memory_order, memory_order) volatile noexcept;
    bool compare_exchange_strong(integral &, integral , memory_order, memory_order) noexcept;
    bool compare_exchange_weak(integral &, integral , memory_order = memory_order_seq_cst) volatile noexcept;
    bool compare_exchange_weak(integral &, integral , memory_order = memory_order_seq_cst) noexcept;
    bool compare_exchange_strong(integral &, integral , memory_order = memory_order_seq_cst) volatile noexcept;
    bool compare_exchange_strong(integral &, integral , memory_order = memory_order_seq_cst) noexcept;
    integral fetch_add(integral , memory_order = memory_order_seq_cst) volatile noexcept;
    integral fetch_add(integral , memory_order = memory_order_seq_cst) noexcept;
    integral fetch_sub(integral , memory_order = memory_order_seq_cst) volatile noexcept;
    integral fetch_sub(integral , memory_order = memory_order_seq_cst) noexcept;
    integral fetch_and(integral , memory_order = memory_order_seq_cst) volatile noexcept;
    integral fetch_and(integral , memory_order = memory_order_seq_cst) noexcept;
    integral fetch_or(integral , memory_order = memory_order_seq_cst) volatile noexcept;
    integral fetch_or(integral , memory_order = memory_order_seq_cst) noexcept;
    integral fetch_xor(integral , memory_order = memory_order_seq_cst) volatile noexcept;
    integral fetch_xor(integral , memory_order = memory_order_seq_cst) noexcept;
            
    atomic() noexcept = default;
    constexpr atomic(integral ) noexcept;
    atomic(const atomic&) = delete;
    atomic& operator=(const atomic&) = delete;
    atomic& operator=(const atomic&) volatile = delete;
    integral operator=(integral ) volatile noexcept;
    integral operator=(integral ) noexcept;
        
    integral operator++(int) volatile noexcept;
    integral operator++(int) noexcept;
    integral operator--(int) volatile noexcept;
    integral operator--(int) noexcept;
    integral operator++() volatile noexcept;
    integral operator++() noexcept;
    integral operator--() volatile noexcept;
    integral operator--() noexcept;
    integral operator+=(integral ) volatile noexcept;
    integral operator+=(integral ) noexcept;
    integral operator-=(integral ) volatile noexcept;
    integral operator-=(integral ) noexcept;
    integral operator&=(integral ) volatile noexcept;
    integral operator&=(integral ) noexcept;
    integral operator|=(integral ) volatile noexcept;
    integral operator|=(integral ) noexcept;
    integral operator^=(integral ) volatile noexcept;
    integral operator^=(integral ) noexcept;
  };
    
  template <class T> struct atomic<T*> {
    bool is_lock_free() const volatile noexcept;
    bool is_lock_free() const noexcept;
    void store(T*, memory_order = memory_order_seq_cst) volatile noexcept;
    void store(T*, memory_order = memory_order_seq_cst) noexcept;
    T* load(memory_order = memory_order_seq_cst) const volatile noexcept;
    T* load(memory_order = memory_order_seq_cst) const noexcept;
    operator T*() const volatile noexcept;
    operator T*() const noexcept;
    T* exchange(T*, memory_order = memory_order_seq_cst) volatile noexcept;
    T* exchange(T*, memory_order = memory_order_seq_cst) noexcept;
    bool compare_exchange_weak(T*&, T*, memory_order, memory_order) volatile noexcept;
    bool compare_exchange_weak(T*&, T*, memory_order, memory_order) noexcept;
    bool compare_exchange_strong(T*&, T*, memory_order, memory_order) volatile noexcept;
    bool compare_exchange_strong(T*&, T*, memory_order, memory_order) noexcept;
    bool compare_exchange_weak(T*&, T*, memory_order = memory_order_seq_cst) volatile noexcept;
    bool compare_exchange_weak(T*&, T*, memory_order = memory_order_seq_cst) noexcept;
    bool compare_exchange_strong(T*&, T*, memory_order = memory_order_seq_cst) volatile noexcept;
    bool compare_exchange_strong(T*&, T*, memory_order = memory_order_seq_cst) noexcept;
    T* fetch_add(ptrdiff_t, memory_order = memory_order_seq_cst) volatile noexcept;
    T* fetch_add(ptrdiff_t, memory_order = memory_order_seq_cst) noexcept;
    T* fetch_sub(ptrdiff_t, memory_order = memory_order_seq_cst) volatile noexcept;
    T* fetch_sub(ptrdiff_t, memory_order = memory_order_seq_cst) noexcept;
    
    atomic() noexcept = default;
    constexpr atomic(T*) noexcept;
    atomic(const atomic&) = delete;
    atomic& operator=(const atomic&) = delete;
    atomic& operator=(const atomic&) volatile = delete;

    T* operator=(T*) volatile noexcept;
    T* operator=(T*) noexcept;
    T* operator++(int) volatile noexcept;
    T* operator++(int) noexcept;
    T* operator--(int) volatile noexcept;
    T* operator--(int) noexcept;
    T* operator++() volatile noexcept;
    T* operator++() noexcept;
    T* operator--() volatile noexcept;
    T* operator--() noexcept;
    T* operator+=(ptrdiff_t) volatile noexcept;
    T* operator+=(ptrdiff_t) noexcept;
    T* operator-=(ptrdiff_t) volatile noexcept;
    T* operator-=(ptrdiff_t) noexcept;
  };
  }
#+end_src

