public_html/C-C++/C++/C++11-atomic- operations.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Atomic types</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">namespace</span> <span style="color: #7fffd4;">std</span> {
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt; <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">atomic</span> {
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">is_lock_free</span>() <span style="color: #00ffff;">const</span> <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">is_lock_free</span>() <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">store</span>(<span style="color: #98fb98;">T</span>, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">store</span>(<span style="color: #98fb98;">T</span>, memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">T</span> <span style="color: #87cefa;">load</span>(memory_order = memory_order_seq_cst) <span style="color: #00ffff;">const</span> <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">T</span> <span style="color: #87cefa;">load</span>(memory_order = memory_order_seq_cst) <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #00ffff;">operator</span> <span style="color: #98fb98;">T</span>() <span style="color: #00ffff;">const</span> <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #00ffff;">operator</span> <span style="color: #98fb98;">T</span>() <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">T</span> <span style="color: #87cefa;">exchange</span>(<span style="color: #98fb98;">T</span>, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">T</span> <span style="color: #87cefa;">exchange</span>(<span style="color: #98fb98;">T</span>, memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_weak</span>(<span style="color: #98fb98;">T</span>&amp;, <span style="color: #98fb98;">T</span>, memory_order, memory_order) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_weak</span>(<span style="color: #98fb98;">T</span>&amp;, <span style="color: #98fb98;">T</span>, memory_order, memory_order) noexcept;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_strong</span>(<span style="color: #98fb98;">T</span>&amp;, <span style="color: #98fb98;">T</span>, memory_order, memory_order) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_strong</span>(<span style="color: #98fb98;">T</span>&amp;, <span style="color: #98fb98;">T</span>, memory_order, memory_order) noexcept;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_weak</span>(<span style="color: #98fb98;">T</span>&amp;, <span style="color: #98fb98;">T</span>, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_weak</span>(<span style="color: #98fb98;">T</span>&amp;, <span style="color: #98fb98;">T</span>, memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_strong</span>(<span style="color: #98fb98;">T</span>&amp;, <span style="color: #98fb98;">T</span>, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_strong</span>(<span style="color: #98fb98;">T</span>&amp;, <span style="color: #98fb98;">T</span>, memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #87cefa;">atomic</span>() noexcept = <span style="color: #00ffff;">default</span>;
  <span style="color: #98fb98;">constexpr</span> <span style="color: #87cefa;">atomic</span>(<span style="color: #98fb98;">T</span>) noexcept;
  <span style="color: #87cefa;">atomic</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">atomic</span>&amp;) = <span style="color: #00ffff;">delete</span>;
  <span style="color: #98fb98;">atomic</span>&amp; <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">=</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">atomic</span>&amp;) = <span style="color: #00ffff;">delete</span>;
  <span style="color: #98fb98;">atomic</span>&amp; <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">=</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">atomic</span>&amp;) <span style="color: #00ffff;">volatile</span> = <span style="color: #00ffff;">delete</span>;
  <span style="color: #98fb98;">T</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">=</span>(<span style="color: #98fb98;">T</span>) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">T</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">=</span>(<span style="color: #98fb98;">T</span>) noexcept;
};

<span style="color: #00ffff;">template</span> &lt;&gt; <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">atomic</span>&lt;integral &gt; {
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">is_lock_free</span>() <span style="color: #00ffff;">const</span> <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">is_lock_free</span>() <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">store</span>(integral , memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">store</span>(integral , memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">load</span>(memory_order = memory_order_seq_cst) <span style="color: #00ffff;">const</span> <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">load</span>(memory_order = memory_order_seq_cst) <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #00ffff;">operator</span> <span style="color: #98fb98;">integral</span>() <span style="color: #00ffff;">const</span> <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #00ffff;">operator</span> <span style="color: #98fb98;">integral</span>() <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">exchange</span>(<span style="color: #98fb98;">integral</span> , memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">exchange</span>(<span style="color: #98fb98;">integral</span> , memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_weak</span>(<span style="color: #98fb98;">integral</span> &amp;, <span style="color: #98fb98;">integral</span> , memory_order, memory_order) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_weak</span>(<span style="color: #98fb98;">integral</span> &amp;, <span style="color: #98fb98;">integral</span> , memory_order, memory_order) noexcept;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_strong</span>(<span style="color: #98fb98;">integral</span> &amp;, <span style="color: #98fb98;">integral</span> , memory_order, memory_order) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_strong</span>(<span style="color: #98fb98;">integral</span> &amp;, <span style="color: #98fb98;">integral</span> , memory_order, memory_order) noexcept;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_weak</span>(<span style="color: #98fb98;">integral</span> &amp;, <span style="color: #98fb98;">integral</span> , memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_weak</span>(<span style="color: #98fb98;">integral</span> &amp;, <span style="color: #98fb98;">integral</span> , memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_strong</span>(<span style="color: #98fb98;">integral</span> &amp;, <span style="color: #98fb98;">integral</span> , memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_strong</span>(<span style="color: #98fb98;">integral</span> &amp;, <span style="color: #98fb98;">integral</span> , memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_add</span>(<span style="color: #98fb98;">integral</span> , memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_add</span>(<span style="color: #98fb98;">integral</span> , memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_sub</span>(<span style="color: #98fb98;">integral</span> , memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_sub</span>(<span style="color: #98fb98;">integral</span> , memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_and</span>(<span style="color: #98fb98;">integral</span> , memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_and</span>(<span style="color: #98fb98;">integral</span> , memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_or</span>(<span style="color: #98fb98;">integral</span> , memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_or</span>(<span style="color: #98fb98;">integral</span> , memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_xor</span>(<span style="color: #98fb98;">integral</span> , memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_xor</span>(<span style="color: #98fb98;">integral</span> , memory_order = memory_order_seq_cst) noexcept;

  atomic() noexcept = <span style="color: #00ffff;">default</span>;
  <span style="color: #98fb98;">constexpr</span> <span style="color: #87cefa;">atomic</span>(<span style="color: #98fb98;">integral</span> ) noexcept;
  atomic(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">atomic</span>&amp;) = <span style="color: #00ffff;">delete</span>;
  <span style="color: #98fb98;">atomic</span>&amp; <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">=</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">atomic</span>&amp;) = <span style="color: #00ffff;">delete</span>;
  <span style="color: #98fb98;">atomic</span>&amp; <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">=</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">atomic</span>&amp;) <span style="color: #00ffff;">volatile</span> = <span style="color: #00ffff;">delete</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">=</span>(<span style="color: #98fb98;">integral</span> ) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">=</span>(<span style="color: #98fb98;">integral</span> ) noexcept;

  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">++</span>(<span style="color: #98fb98;">int</span>) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">++</span>(<span style="color: #98fb98;">int</span>) noexcept;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">--</span>(<span style="color: #98fb98;">int</span>) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">--</span>(<span style="color: #98fb98;">int</span>) noexcept;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">++</span>() <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">++</span>() noexcept;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">--</span>() <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">--</span>() noexcept;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">+=</span>(<span style="color: #98fb98;">integral</span> ) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">+=</span>(<span style="color: #98fb98;">integral</span> ) noexcept;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">-=</span>(<span style="color: #98fb98;">integral</span> ) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">-=</span>(<span style="color: #98fb98;">integral</span> ) noexcept;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">&amp;=</span>(<span style="color: #98fb98;">integral</span> ) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">&amp;=</span>(<span style="color: #98fb98;">integral</span> ) noexcept;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">|=</span>(<span style="color: #98fb98;">integral</span> ) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">|=</span>(<span style="color: #98fb98;">integral</span> ) noexcept;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">^=</span>(<span style="color: #98fb98;">integral</span> ) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">^=</span>(<span style="color: #98fb98;">integral</span> ) noexcept;
};

<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt; <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>*&gt; {
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">is_lock_free</span>() <span style="color: #00ffff;">const</span> <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">is_lock_free</span>() <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">store</span>(<span style="color: #98fb98;">T</span>*, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">store</span>(<span style="color: #98fb98;">T</span>*, memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">T</span>* <span style="color: #87cefa;">load</span>(memory_order = memory_order_seq_cst) <span style="color: #00ffff;">const</span> <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #87cefa;">load</span>(memory_order = memory_order_seq_cst) <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #00ffff;">operator</span> <span style="color: #98fb98;">T</span>*() <span style="color: #00ffff;">const</span> <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #00ffff;">operator</span> <span style="color: #98fb98;">T</span>*() <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #87cefa;">exchange</span>(<span style="color: #98fb98;">T</span>*, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #87cefa;">exchange</span>(<span style="color: #98fb98;">T</span>*, memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_weak</span>(<span style="color: #98fb98;">T</span>*&amp;, <span style="color: #98fb98;">T</span>*, memory_order, memory_order) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_weak</span>(<span style="color: #98fb98;">T</span>*&amp;, <span style="color: #98fb98;">T</span>*, memory_order, memory_order) noexcept;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_strong</span>(<span style="color: #98fb98;">T</span>*&amp;, <span style="color: #98fb98;">T</span>*, memory_order, memory_order) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_strong</span>(<span style="color: #98fb98;">T</span>*&amp;, <span style="color: #98fb98;">T</span>*, memory_order, memory_order) noexcept;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_weak</span>(<span style="color: #98fb98;">T</span>*&amp;, <span style="color: #98fb98;">T</span>*, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_weak</span>(<span style="color: #98fb98;">T</span>*&amp;, <span style="color: #98fb98;">T</span>*, memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_strong</span>(<span style="color: #98fb98;">T</span>*&amp;, <span style="color: #98fb98;">T</span>*, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">compare_exchange_strong</span>(<span style="color: #98fb98;">T</span>*&amp;, <span style="color: #98fb98;">T</span>*, memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">T</span>* <span style="color: #87cefa;">fetch_add</span>(<span style="color: #98fb98;">ptrdiff_t</span>, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #87cefa;">fetch_add</span>(<span style="color: #98fb98;">ptrdiff_t</span>, memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">T</span>* <span style="color: #87cefa;">fetch_sub</span>(<span style="color: #98fb98;">ptrdiff_t</span>, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #87cefa;">fetch_sub</span>(<span style="color: #98fb98;">ptrdiff_t</span>, memory_order = memory_order_seq_cst) noexcept;

  <span style="color: #87cefa;">atomic</span>() noexcept = <span style="color: #00ffff;">default</span>;
  <span style="color: #98fb98;">constexpr</span> <span style="color: #87cefa;">atomic</span>(<span style="color: #98fb98;">T</span>*) noexcept;
  <span style="color: #87cefa;">atomic</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">atomic</span>&amp;) = <span style="color: #00ffff;">delete</span>;
  <span style="color: #98fb98;">atomic</span>&amp; <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">=</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">atomic</span>&amp;) = <span style="color: #00ffff;">delete</span>;
  <span style="color: #98fb98;">atomic</span>&amp; <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">=</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">atomic</span>&amp;) <span style="color: #00ffff;">volatile</span> = <span style="color: #00ffff;">delete</span>;

  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">=</span>(<span style="color: #98fb98;">T</span>*) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">=</span>(<span style="color: #98fb98;">T</span>*) noexcept;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">++</span>(<span style="color: #98fb98;">int</span>) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">++</span>(<span style="color: #98fb98;">int</span>) noexcept;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">--</span>(<span style="color: #98fb98;">int</span>) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">--</span>(<span style="color: #98fb98;">int</span>) noexcept;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">++</span>() <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">++</span>() noexcept;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">--</span>() <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">--</span>() noexcept;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">+=</span>(<span style="color: #98fb98;">ptrdiff_t</span>) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">+=</span>(<span style="color: #98fb98;">ptrdiff_t</span>) noexcept;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">-=</span>(<span style="color: #98fb98;">ptrdiff_t</span>) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">-=</span>(<span style="color: #98fb98;">ptrdiff_t</span>) noexcept;
};
}
</pre>
</div>
</div>
</div>
