src/C-C++/C++/C++11-atomic- operations.org
* Flag type and operations
#+begin_src c++
  namespace std {
  typedef struct atomic_flag {
    bool test_and_set(memory_order = memory_order_seq_cst) volatile noexcept;
    bool test_and_set(memory_order = memory_order_seq_cst) noexcept;
    void clear(memory_order = memory_order_seq_cst) volatile noexcept;
    void clear(memory_order = memory_order_seq_cst) noexcept;
    atomic_flag() noexcept = default;
    atomic_flag(const atomic_flag&) = delete;
    atomic_flag& operator=(const atomic_flag&) = delete;
    atomic_flag& operator=(const atomic_flag&) volatile = delete;
  } atomic_flag;
  bool atomic_flag_test_and_set(volatile atomic_flag*) noexcept;
  bool atomic_flag_test_and_set(atomic_flag*) noexcept;
  bool atomic_flag_test_and_set_explicit(volatile atomic_flag*, memory_order) noexcept;
  bool atomic_flag_test_and_set_explicit(atomic_flag*, memory_order) noexcept;
  void atomic_flag_clear(volatile atomic_flag*) noexcept;
  void atomic_flag_clear(atomic_flag*) noexcept;
  void atomic_flag_clear_explicit(volatile atomic_flag*, memory_order) noexcept;
  void atomic_flag_clear_explicit(atomic_flag*, memory_order) noexcept;
  #define ATOMIC_FLAG_INIT see below
  }
#+end_src

* Memory synchronization ordering
#+begin_src c++
namespace std {
typedef enum memory_order {
memory_order_relaxed, memory_order_consume, memory_order_acquire,
memory_order_release, memory_order_acq_rel, memory_order_seq_cst
} memory_order;
}

template <class T>
T kill_dependency(T y) noexcept;

extern "C" void atomic_thread_fence(memory_order order) noexcept;

extern "C" void atomic_signal_fence(memory_order order) noexcept;
#+end_src


+ memory_order_relaxed: no operation orders memory.
+ memory_order_release, memory_order_acq_rel, and
  memory_order_seq_cst: a store operation performs a release operation
  on the affected memory location.
+ memory_order_consume: a load operation performs a consume operation
  on the affected memory location.
+ memory_order_acquire, memory_order_acq_rel, and
  memory_order_seq_cst: a load operation performs an acquire operation
  on the affected memory location.

* 其他资料
<<reference>>

** Online resources
+ [[https://gcc.gnu.org/onlinedocs/gcc-4.7.0/gcc/_005f_005fsync-Builtins.html][GCC built-in functions for atomic memory access]]
+ [[http://preshing.com/20130618/atomic-vs-non-atomic-operations/][Atomic vs. Non-Atomic Operations]]

* Header synopsis
