public_html/C-C++/C++/C++11-atomic- operations.html
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Flag type and operations</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">namespace</span> <span style="color: #7fffd4;">std</span> {
<span style="color: #00ffff;">typedef</span> <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">atomic_flag</span> {
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">test_and_set</span>(memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">test_and_set</span>(memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">clear</span>(memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">noexcept</span>;
  <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">clear</span>(memory_order = memory_order_seq_cst) noexcept;
  <span style="color: #87cefa;">atomic_flag</span>() noexcept = <span style="color: #00ffff;">default</span>;
  <span style="color: #87cefa;">atomic_flag</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">atomic_flag</span>&amp;) = <span style="color: #00ffff;">delete</span>;
  <span style="color: #98fb98;">atomic_flag</span>&amp; <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">=</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">atomic_flag</span>&amp;) = <span style="color: #00ffff;">delete</span>;
  <span style="color: #98fb98;">atomic_flag</span>&amp; <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">=</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">atomic_flag</span>&amp;) <span style="color: #00ffff;">volatile</span> = <span style="color: #00ffff;">delete</span>;
} <span style="color: #98fb98;">atomic_flag</span>;
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_flag_test_and_set</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic_flag</span>*) noexcept;
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_flag_test_and_set</span>(<span style="color: #98fb98;">atomic_flag</span>*) noexcept;
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_flag_test_and_set_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic_flag</span>*, memory_order) noexcept;
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_flag_test_and_set_explicit</span>(<span style="color: #98fb98;">atomic_flag</span>*, memory_order) noexcept;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_flag_clear</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic_flag</span>*) noexcept;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_flag_clear</span>(<span style="color: #98fb98;">atomic_flag</span>*) noexcept;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_flag_clear_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic_flag</span>*, memory_order) noexcept;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_flag_clear_explicit</span>(<span style="color: #98fb98;">atomic_flag</span>*, memory_order) noexcept;
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_FLAG_INIT</span> see below
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Memory synchronization ordering</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">namespace</span> <span style="color: #7fffd4;">std</span> {
<span style="color: #00ffff;">typedef</span> <span style="color: #00ffff;">enum</span> <span style="color: #98fb98;">memory_order</span> {
<span style="color: #eedd82;">memory_order_relaxed</span>, <span style="color: #eedd82;">memory_order_consume</span>, <span style="color: #eedd82;">memory_order_acquire</span>,
<span style="color: #eedd82;">memory_order_release</span>, <span style="color: #eedd82;">memory_order_acq_rel</span>, <span style="color: #eedd82;">memory_order_seq_cst</span>
} <span style="color: #98fb98;">memory_order</span>;
}

<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">kill_dependency</span>(<span style="color: #98fb98;">T</span> <span style="color: #eedd82;">y</span>) noexcept;

<span style="color: #00ffff;">extern</span> <span style="color: #ffa07a;">"C"</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_thread_fence</span>(<span style="color: #98fb98;">memory_order</span> <span style="color: #eedd82;">order</span>) noexcept;

<span style="color: #00ffff;">extern</span> <span style="color: #ffa07a;">"C"</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_signal_fence</span>(<span style="color: #98fb98;">memory_order</span> <span style="color: #eedd82;">order</span>) noexcept;
</pre>
</div>


<ul class="org-ul">
<li>memory<sub>order</sub><sub>relaxed</sub>: no operation orders memory.
</li>
<li>memory<sub>order</sub><sub>release</sub>, memory<sub>order</sub><sub>acq</sub><sub>rel</sub>, and
memory<sub>order</sub><sub>seq</sub><sub>cst</sub>: a store operation performs a release operation
on the affected memory location.
</li>
<li>memory<sub>order</sub><sub>consume</sub>: a load operation performs a consume operation
on the affected memory location.
</li>
<li>memory<sub>order</sub><sub>acquire</sub>, memory<sub>order</sub><sub>acq</sub><sub>rel</sub>, and
memory<sub>order</sub><sub>seq</sub><sub>cst</sub>: a load operation performs an acquire operation
on the affected memory location.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">其他资料</h2>
<div class="outline-text-2" id="text-6">
<p>
<a id="reference" name="reference"></a>
</p>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Online resources</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li><a href="https://gcc.gnu.org/onlinedocs/gcc-4.7.0/gcc/_005f_005fsync-Builtins.html">GCC built-in functions for atomic memory access</a>
</li>
<li><a href="http://preshing.com/20130618/atomic-vs-non-atomic-operations/">Atomic vs. Non-Atomic Operations</a>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Header synopsis</h2>
