public_html/C-C++/C++/C++11-atomic- operations.html
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><code>&lt;atomic&gt;</code></h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">namespace</span> <span style="color: #7fffd4;">std</span> {
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">29.3, order and consistency</span>
<span style="color: #00ffff;">enum</span> <span style="color: #98fb98;">memory_order</span>;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">kill_dependency</span>(<span style="color: #98fb98;">T</span> <span style="color: #eedd82;">y</span>) noexcept;
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">29.4, lock-free property</span>
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_BOOL_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_CHAR_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_CHAR16_T_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_CHAR32_T_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_WCHAR_T_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_SHORT_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_INT_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_LONG_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_LLONG_LOCK_FREE</span> unspecified
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_POINTER_LOCK_FREE</span> unspecified
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">29.5, generic types</span>
<span style="color: #00ffff;">template</span>&lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt; <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">atomic</span>;
<span style="color: #00ffff;">template</span>&lt;&gt; <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">atomic</span>&lt;integral &gt;;
<span style="color: #00ffff;">template</span>&lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt; <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>*&gt;;
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">29.6.1, general operations on atomic types</span>
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">In the following declarations, atomic-type is either</span>
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">atomic&lt;T&gt; or a named base class for T from</span>
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Table 145 or inferred from Table 146 or from bool.</span>
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">If it is atomic&lt;T&gt;, then the declaration is a template</span>
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">declaration prefixed with template &lt;class T&gt;.</span>
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_is_lock_free</span>(<span style="color: #00ffff;">const</span> <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-type *) noexcept;
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_is_lock_free</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">atomic</span>-type *) noexcept;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_init</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-type *, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_init</span>(atomic-type *, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_store</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-type *, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_store</span>(atomic-type *, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_store_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-type *, <span style="color: #98fb98;">T</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_store_explicit</span>(atomic-type *, <span style="color: #98fb98;">T</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_load</span>(<span style="color: #00ffff;">const</span> <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-type *) noexcept;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_load</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">atomic</span>-type *) noexcept;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_load_explicit</span>(<span style="color: #00ffff;">const</span> <span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-type *, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_load_explicit</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">atomic</span>-type *, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_exchange</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-type *, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_exchange</span>(atomic-type *, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_exchange_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-type *, <span style="color: #98fb98;">T</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_exchange_explicit</span>(atomic-type *, <span style="color: #98fb98;">T</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_compare_exchange_weak</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-type *, <span style="color: #98fb98;">T</span>*, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_compare_exchange_weak</span>(atomic-type *, <span style="color: #98fb98;">T</span>*, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_compare_exchange_strong</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-type *, <span style="color: #98fb98;">T</span>*, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_compare_exchange_strong</span>(atomic-type *, <span style="color: #98fb98;">T</span>*, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_compare_exchange_weak_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-type *, <span style="color: #98fb98;">T</span>*, <span style="color: #98fb98;">T</span>,
<span style="color: #98fb98;">memory_order</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_compare_exchange_weak_explicit</span>(atomic-type *, <span style="color: #98fb98;">T</span>*, T.
memory_order, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">bool</span> <span style="color: #eedd82;">atomic_compare</span>)exchange_strong_explicit(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-type *, <span style="color: #98fb98;">T</span>*, T,
memory_order, memory_order) noexcept;
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_compare_exchange_strong_explicit</span>(atomic-type *, <span style="color: #98fb98;">T</span>*, <span style="color: #98fb98;">T</span>,
<span style="color: #98fb98;">memory_order</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">29.6.2, templated operations on atomic types</span>
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_add</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_add</span>(<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_add_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_add_explicit</span>(<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_sub</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_sub</span>(<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_sub_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_sub_explicit</span>(<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_and</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_and</span>(<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_and_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_and_explicit</span>(<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_or</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_or</span>(<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_or_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_or_explicit</span>(<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_xor</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_xor</span>(<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_xor_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span> <span style="color: #87cefa;">atomic_fetch_xor_explicit</span>(<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>&gt;*, <span style="color: #98fb98;">T</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">29.6.3, arithmetic operations on atomic types</span>
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">In the following declarations, atomic-integral is either</span>
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">atomic&lt;T&gt; or a named base class for T from</span>
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Table 145 or inferred from Table 146.</span>
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">If it is atomic&lt;T&gt;, then the declaration is a template</span>
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">specialization declaration prefixed with template &lt;&gt;.</span>
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_add</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-integral *, <span style="color: #98fb98;">integral</span> ) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_add</span>(atomic-integral *, <span style="color: #98fb98;">integral</span> ) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_add_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-integral *, <span style="color: #98fb98;">integral</span> , <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_add_explicit</span>(atomic-integral *, <span style="color: #98fb98;">integral</span> , <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_sub</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-integral *, <span style="color: #98fb98;">integral</span> ) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_sub</span>(atomic-integral *, <span style="color: #98fb98;">integral</span> ) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_sub_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-integral *, <span style="color: #98fb98;">integral</span> , <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_sub_explicit</span>(atomic-integral *, <span style="color: #98fb98;">integral</span> , <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_and</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-integral *, <span style="color: #98fb98;">integral</span> ) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_and</span>(atomic-integral *, <span style="color: #98fb98;">integral</span> ) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_and_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-integral *, <span style="color: #98fb98;">integral</span> , <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_and_explicit</span>(atomic-integral *, <span style="color: #98fb98;">integral</span> , <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_or</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-integral *, <span style="color: #98fb98;">integral</span> ) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_or</span>(atomic-integral *, <span style="color: #98fb98;">integral</span> ) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_or_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-integral *, <span style="color: #98fb98;">integral</span> , <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_or_explicit</span>(atomic-integral *, <span style="color: #98fb98;">integral</span> , <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_xor</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-integral *, <span style="color: #98fb98;">integral</span> ) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_xor</span>(atomic-integral *, <span style="color: #98fb98;">integral</span> ) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_xor_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>-integral *, <span style="color: #98fb98;">integral</span> , <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">atomic_fetch_xor_explicit</span>(atomic-integral *, <span style="color: #98fb98;">integral</span> , <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">29.6.4, partial specializations for pointers</span>
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span>* <span style="color: #87cefa;">atomic_fetch_add</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>*&gt;*, <span style="color: #98fb98;">ptrdiff_t</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span>* <span style="color: #87cefa;">atomic_fetch_add</span>(<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>*&gt;*, <span style="color: #98fb98;">ptrdiff_t</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span>* <span style="color: #87cefa;">atomic_fetch_add_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>*&gt;*, <span style="color: #98fb98;">ptrdiff_t</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span>* <span style="color: #87cefa;">atomic_fetch_add_explicit</span>(<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>*&gt;*, <span style="color: #98fb98;">ptrdiff_t</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span>* <span style="color: #87cefa;">atomic_fetch_sub</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>*&gt;*, <span style="color: #98fb98;">ptrdiff_t</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span>* <span style="color: #87cefa;">atomic_fetch_sub</span>(<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>*&gt;*, <span style="color: #98fb98;">ptrdiff_t</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span>* <span style="color: #87cefa;">atomic_fetch_sub_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>*&gt;*, <span style="color: #98fb98;">ptrdiff_t</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #98fb98;">T</span>* <span style="color: #87cefa;">atomic_fetch_sub_explicit</span>(<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>*&gt;*, <span style="color: #98fb98;">ptrdiff_t</span>, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">29.6.5, initialization</span>
<span style="color: #b0c4de;">#define</span> <span style="color: #87cefa;">ATOMIC_VAR_INIT</span>(<span style="color: #eedd82;">value</span>) <span style="color: #98fb98;">see</span> <span style="color: #eedd82;">below</span>
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">29.7, flag type and operations</span>
<span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">atomic_flag</span>;
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_flag_test_and_set</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic_flag</span>*) noexcept;
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_flag_test_andset</span>(<span style="color: #98fb98;">atomic_flag</span>*) noexcept;
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_flag_test_and_set_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic_flag</span>*, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">atomic_flag_test_and_set_explicit</span>(<span style="color: #98fb98;">atomic_flag</span>*, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_flag_clear</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic_flag</span>*) noexcept;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_flag_clear</span>(<span style="color: #98fb98;">atomic_flag</span>*) noexcept;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_flag_clear_explicit</span>(<span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">atomic_flag</span>*, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_flag_clear_explicit</span>(<span style="color: #98fb98;">atomic_flag</span>*, <span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">ATOMIC_FLAG_INIT</span> see below
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">29.8, fences</span>
<span style="color: #00ffff;">extern</span> <span style="color: #ffa07a;">"C"</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_thread_fence</span>(<span style="color: #98fb98;">memory_order</span>) noexcept;
<span style="color: #00ffff;">extern</span> <span style="color: #ffa07a;">"C"</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">atomic_signal_fence</span>(<span style="color: #98fb98;">memory_order</span>) noexcept;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">cc</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">

<pre class="src src-c++"></pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2014-08-26 Tue 20:07</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.3a)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
